results/res/disagg_1080p_h200_h200_32b_image8_n32/test_sglang_multi_rates_1080p_20260514_170045/rate_0.25/results.txt
/opt/sglang/python/sglang/benchmark/datasets/image.py:51: UserWarning: High resolution (1080x1920) with 256 total images may take a long time. Consider reducing resolution or image count.
  return sample_image_requests(
benchmark_args=Namespace(backend='sglang-oai-chat', base_url='http://localhost:7001', host='0.0.0.0', port=None, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', model='/mnt/weka/data/llm-d-models-pv/models--Qwen--Qwen3-VL-32B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=256, random_range_ratio=0.0, image_count=8, image_resolution='1920x1080', random_image_count=False, image_format='jpeg', image_content='random', request_rate=0.25, use_trace_timestamps=False, max_concurrency=None, output_file='/hongming/res/h200_h200_disagg_32b_image8_1080p_numprompt32/test_sglang_multi_rates_1080p_20260514_170045/rate_0.25/benchmark_output.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=0, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://localhost:7001/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai-chat', base_url='http://localhost:7001', host='0.0.0.0', port=30000, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', model='/mnt/weka/data/llm-d-models-pv/models--Qwen--Qwen3-VL-32B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=256, random_range_ratio=0.0, image_count=8, image_resolution='1920x1080', random_image_count=False, image_format='jpeg', image_content='random', request_rate=0.25, use_trace_timestamps=False, max_concurrency=None, output_file='/hongming/res/h200_h200_disagg_32b_image8_1080p_numprompt32/test_sglang_multi_rates_1080p_20260514_170045/rate_0.25/benchmark_output.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=0, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 525172
#Output tokens: 4884
#Total images: 256
#Images per request: 8 (fixed)

Created 32 random jpeg images with average 16723263 bytes per request
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 32/32 [02:58<00:00,  5.57s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    0.25      
Max request concurrency:                 not set   
Successful requests:                     32        
Benchmark duration (s):                  178.34    
Total input tokens:                      525172    
Total input text tokens:                 2420      
Total input vision tokens:               522752    
Total generated tokens:                  4884      
Total generated tokens (retokenized):    4849      
Request throughput (req/s):              0.18      
Input token throughput (tok/s):          2944.83   
Output token throughput (tok/s):         27.39     
Peak output token throughput (tok/s):    598.00    
Peak concurrent requests:                28        
Total token throughput (tok/s):          2972.21   
Concurrency:                             17.12     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   95432.58  
Median E2E Latency (ms):                 99134.36  
P90 E2E Latency (ms):                    130767.26 
P99 E2E Latency (ms):                    144534.46 
---------------Time to First Token----------------
Mean TTFT (ms):                          42730.76  
Median TTFT (ms):                        47318.28  
P99 TTFT (ms):                           82452.34  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          536.85    
Median TPOT (ms):                        355.31    
P99 TPOT (ms):                           2507.45   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           354.31    
Median ITL (ms):                         37.89     
P95 ITL (ms):                            116.76    
P99 ITL (ms):                            2972.41   
Max ITL (ms):                            103112.33 
==================================================